#==============================================================================
# ■ 系统初始化
#------------------------------------------------------------------------------
# 　配置系统的各种初始化值。
#   
#==============================================================================

module GAME_INIT
  #--------------------------------------------------------------------------
  # ●  获得武器的属性加成
  #
  #   suit_id : 装备id--[1,999]=item; [1001,1999]=weapon; [2001,2999]=armor
  #   string  : 暂时没用，请传入""
  #   color_string: 描述颜色的字符串--参考Kernel::getColor(color)
  #
  #   返回    ：结构体: [["生命+100","攻击+10","防御+1"], ["light green","red"]]    
  # 
  #   e.g.  返回3号armor的属性，颜色为浅绿色
  #
  #     getSuitAttr(2003, "", "light green")
  #    
  #--------------------------------------------------------------------------
  def self.getSuitAttr(suit_id, string, color_string)
    if suit_id <= 1000 or suit_id >= 3000 or suit_id == 2000
      item = nil
    # armors
    elsif suit_id > 2000
      item = $data_armors[suit_id - 2000]
    elsif suit_id > 1000
      item = $data_weapons[suit_id - 1000]
    else
      item = nil
    end
    
    if nil == item
      return nil
    end
    
    values = []
	colors = []
    
	strength_val = item.read_suit_attr('strength')
	if nil != strength_val
		values.push("力量            +  "+strength_val.to_s) 
		colors.push("red")
	end
	
    maxhp_val = item.read_suit_attr('maxhp')
	if nil != maxhp_val
		values.push("最大生命   +  "+maxhp_val.to_s)
		colors.push("red")
	end
	maxhprate_val = item.read_suit_attr('maxhprate')
	if nil != maxhprate_val
		values.push("最大生命   +  "+maxhprate_val.to_s+"%")
		colors.push("red")
	end
	
	destroy_val = item.read_suit_attr('destroy')
	if nil != destroy_val
		values.push("物理伤害   +  "+destroy_val.to_s)
		colors.push("heavy orange")
	end
    destroyr_val = item.read_suit_attr('destroyr')
	if nil != destroyr_val
		values.push("物伤威力   +  "+destroyr_val.to_s+"%")
		colors.push("heavy orange")
	end
	
	bom_val = item.read_suit_attr('bom')
	if nil != bom_val
		values.push("暴击技巧   +  "+bom_val.to_s) 
		colors.push("light yellow")
	end
    bomrate_val = item.read_suit_attr('bomrate')
	if nil != bomrate_val
		values.push("暴击率      +  "+bomrate_val.to_s+"%") 
		colors.push("light yellow")
	end
	
	bomatk_val = item.read_suit_attr('bomatk')
	if nil != bomatk_val
		values.push("暴击威力   +  "+bomatk_val.to_s+"%") 
		colors.push("light yellow")
	end
	#---------------------------------------------------
	#---------------------------------------------------
	celerity_val = item.read_suit_attr('celerity')
	if nil != celerity_val
		values.push("敏捷            +  "+celerity_val.to_s) 
		colors.push("light green")
	end
	
    atk_val = item.read_suit_attr('atk')
	if nil != atk_val
		values.push("攻击            +  "+atk_val.to_s) 
		colors.push("light purple")
	end
    atkrate_val = item.read_suit_attr('atkrate')
	if nil != atkrate_val
		values.push("攻击            +  "+atkrate_val.to_s+"%") 
		colors.push("light purple")
	end
    
	atkspeed_val = item.read_suit_attr('atk_speed')
	if nil != atkspeed_val
		values.push("攻击速度   +  "+atkspeed_val.to_s) 
		colors.push("light purple")
	end
    
    atkspeedrate_val = item.read_suit_attr('atkspeedrate')
	if nil != atkspeedrate_val
		values.push("攻击频率   +  "+atkspeedrate_val.to_s+"%") 
		colors.push("light purple")
	end
	
    ddef_val = item.read_suit_attr('ddef')
	if nil != ddef_val 
		values.push("防御            +  "+ddef_val.to_s) 
		colors.push("light blue")
	end
    defrate_val = item.read_suit_attr('defrate')
	if nil != defrate_val
		values.push("防御            +  "+defrate_val.to_s+"%") 
		colors.push("light blue")
	end
	
	hit_val = item.read_suit_attr('hit')
	if nil != hit_val 
		values.push("命中技巧   +  "+hit_val.to_s) 
		colors.push("light blue")
	end
    hitrate_val = item.read_suit_attr('hitrate')
	if nil != hitrate_val
		values.push("命中率        +  "+hitrate_val.to_s+"%") 
		colors.push("light blue")
	end
	
	eva_val = item.read_suit_attr('eva')
	if nil != eva_val
		values.push("闪避技巧   +  "+eva_val.to_s) 
		colors.push("light blue")
	end
    
    evarate_val = item.read_suit_attr('evarate')
	if nil != evarate_val
		values.push("闪避概率   +  "+evarate_val.to_s+"%")
		colors.push("light blue")
	end
    
	#---------------------------------------------------
	#---------------------------------------------------
	
    hpcover_val = item.read_suit_attr('hpcover')
	if nil != hpcover_val 
		values.push("生命恢复   +  "+hpcover_val.to_s) 
		colors.push("light gray")
	end
    hprate_val = item.read_suit_attr('hprate')
	if nil != hprate_val
		values.push("生命恢复   +  "+hprate_val.to_s+"%") 
		colors.push("light gray")
	end
    
    # --- No use. -----------------------------
    wisdom_val = item.read_suit_attr('wisdom')
	if nil != wisdom_val
		values.push("智力          +"+wisdom_val.to_s) 
		colors.push("light purple")
    end
    
    
    
    if values.size > 0
      return [values, colors]  
    else
      return nil
    end
    
  end  
  
  
#----------------------------------------------------------------------------
#   这是一个套装hash表
# 
#    哈希表中的 2999 代表“防具类型”的999号物品
#
#---------------------------------------------------------------------------  
   Suits_Describe = {

   #------------------------------------------
   # 嗜血套装
   # locate = 7, id = 2999
   #-----------------------------------------
   2999 => 
   [
   # 嗜血面具，locate = 1, id = 25
   25 + 2000,
   
   # 嗜血胸坠，locate = 2, id = 75
   75 + 2000,
   
   # 嗜血指环，locate = 5, id = 94
   94 + 2000,
   
   # 嗜血履，locate = 6, id = 110
   110 + 2000
   
   ],
   
   #------------------------------------------
   # 青龙套装
   # locate = 7, id = 2998
   #-----------------------------------------
   2998 => 
   [
   # 青龙刀， id = 26
   26 + 1000,
   
   # 偃月刀, id = 27
   27 + 1000,
   
   # 青龙盔，locate = 1, id = 28
   28 + 2000,
   
   # 青龙盾，locate = 3, id = 47
   47 + 2000,
   
   # 青龙铠, locate = 4, id = 57
   57 + 2000,
   
   # 青龙靴, locate = 6, id = 114
   114 + 2000
   
   ],   
      
   #------------------------------------------
   # 白虎套装
   # locate = 7, id = 2997
   #-----------------------------------------
   2997 => 
   [
   # 白虎刃， id = 38
   38 + 1000,
   
   # 白虎盔, locate = 1, id = 136
   136 + 2000,
   
   # 白虎盾，locate = 3, id = 137
   137 + 2000,
   
   # 白虎铠，locate = 4, id = 138
   138 + 2000,
   
   # 白虎掌, locate = 5, id = 139
   139 + 2000,
   
   # 白虎靴, locate = 6, id = 140
   140 + 2000
   
   ], 
   
   #------------------------------------------
   # 急速套装
   # locate = 7, id = 2996
   #-----------------------------------------
   2996 => 
   [
   # 急速战衣，locate = 4, id = 54
   54 + 2000,
   
   # 急速胸坠，locate = 2, id = 76
   76 + 2000,
   
   # 急速指环，locate = 5, id = 95
   95 + 2000,
   
   # 急速履，locate = 6, id = 111
   111 + 2000
   
   ],
   
   #------------------------------------------
   # 神力套装
   # locate = 7, id = 2995
   #-----------------------------------------
   2995 => 
   [
   # 玄武骨，locate = 7, id = 12
   12 + 2000,
   
   # 朱雀羽，locate = 7, id = 13
   13 + 2000,
   
   # 战魔项圈，locate = 2, id = 95
   83 + 2000,
   
   # 黯然指环，locate = 5, id = 111
   104 + 2000,
   
   # 青龙套装， locate = 7， id = 998
   998 + 2000,
   
   # 白虎套装， locate = 7， id = 997
   997 + 2000,
   
   ],
   
   
}  




#----------------------------------------------------------------------------
#   下面的可以手动添加一个装备的复杂描述。
#
#    注：并不是所有的装备都必须添加进来，如果没有添加，那么就没有特别说明
#        那么特别显示窗口就不会显示“无特别说明”
#
# 
#---------------------------------------------------------------------------
  Equip_Descriptions = [
  
#===========================================================================
#   ●●●●●●●●●●●●0所有的武器●●●●●●●●●●●●●
#--------------------------------------------------------------------------- 
{ # 这是武器的哈希表
  "26" =>   # 武器的编号
  [ 
    
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    
    [ "green", ]
    
  ],
#-----------------------------------------------------------------------
  "27" =>   # 武器的编号
  [ 
  
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-----------------------------------------------------------------------
  "38" =>   # 武器的编号
  [ 
    
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-----------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●1所有的头部装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是头部装备的哈希表
  "25"  =>    # Armor 的编号
  [
    
    [ "嗜血套装 = ",
      " 嗜血面具 +",
      " 嗜血胸坠 +",
      " 嗜血指环 +",
      " 嗜血履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
  
#------------------------------------------------------------------------
  "28"  =>    # Armor 的编号
  [
    
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------
  "136"  =>    # Armor 的编号
  [
    
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●2所有的项链装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是项链装备的哈希表

  "75"  =>    # Armor 的编号
  [
    
    [ "嗜血套装 = ",
      " 嗜血面具 +",
      " 嗜血胸坠 +",
      " 嗜血指环 +",
      " 嗜血履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
  
  "76"  =>    # Armor 的编号
  [
    
    [ "急速套装 = ",
      " 急速战衣 +",
      " 急速胸坠 +",
      " 急速指环 +",
      " 急速履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
#------------------------------------------------------------------------
  "1310"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容"  ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#-------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●3所有的盾装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是盾装备的哈希表
  "47"  =>    # Armor 的编号
  [
    
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#------------------------------------------------------------------------
  "137"  =>    # Armor 的编号
  [
  
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●4所有的衣服装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是衣服装备的哈希表

#------------------------------------------------------------------------
  "54"  =>    # Armor 的编号
  [
    
    [ "急速套装 = ",
      " 急速战衣 +",
      " 急速胸坠 +",
      " 急速指环 +",
      " 急速履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],


  "57"  =>    # Armor 的编号
  [
    
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------
  "138"  =>    # Armor 的编号
  [
    
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●5所有的戒指装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是戒指装备的哈希表
  "94"  =>    # Armor 的编号
  [
    
    [ "嗜血套装 = ",
      " 嗜血面具 +",
      " 嗜血胸坠 +",
      " 嗜血指环 +",
      " 嗜血履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
  
  "95"  =>    # Armor 的编号
  [
    
    [ "急速套装 = ",
      " 急速战衣 +",
      " 急速胸坠 +",
      " 急速指环 +",
      " 急速履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
#------------------------------------------------------------------------

  "139"  =>    # Armor 的编号
  [
    
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●6所有的鞋子装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是鞋子装备的哈希表
  "110"  =>    # Armor 的编号
  [
    
    [ "嗜血套装 = ",
      " 嗜血面具 +",
      " 嗜血胸坠 +",
      " 嗜血指环 +",
      " 嗜血履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
  "111"  =>    # Armor 的编号
  [
    
    [ "急速套装 = ",
      " 急速战衣 +",
      " 急速胸坠 +",
      " 急速指环 +",
      " 急速履 + ",
      "1000G +",
      "黄色合成石"],
    
    
    [ "yellow"]
  ],
#------------------------------------------------------------------------
  "114"  =>    # Armor 的编号
  [
    
    [ "青龙套装 = ",
      "青龙刀☆ +",
      "偃月刀☆ +",
      "青龙盔☆ +",
      "青龙盾☆ +",
      "青龙铠☆ +",
      "青龙靴☆ +",
      "10000G + ",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------
  "140"  =>    # Armor 的编号
  [
    
    [ "白虎套装 = ",
      "白虎刃☆ +",
      "白虎盔☆ +",
      "白虎盾☆ +",
      "白虎铠☆ +",
      "白虎掌☆ +",
      "白虎靴☆ +",
      "10000G +",
      "绿色合成石"],
    
    [ "green", ]
    
  ],
#-------------------------------------------------------------------------

},
#===========================================================================
#   ●●●●●●●●●●●●7所有的宝物装备●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
{ # 这是宝物装备的哈希表
  "999"  =>    # Armor 的编号
  [
    
    [ "嗜血套装：",
      "攻击+60",
      "防御+12",
      "生命恢复+24",
      "力量+72",
      "物伤威力+6%",
      "攻速+12",
      "攻击频率+1.6%",
      "闪避+6.4",
      "暴击技巧+24",
      "暴击威力+12%"],
    
    
    [ "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow",
      "light yellow"]
  ],
#------------------------------------------------------------------------
  "998"  =>    # Armor 的编号
  [
    
    [ "青龙套装：",
      "最大生命+1920",
      "攻击+288",
      "防御+144",
      "生命恢复+48",
      "力量+432",
      "敏捷+144",
      "物伤威力+16%",
      "攻击频率+4.8%",
      "闪避技巧+38.4",
      "暴击技巧+138.7",
      "暴击威力+80" ],
    
    
    [ "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green"]
  ],

#------------------------------------------------------------------------
  "997"  =>    # Armor 的编号
  [
    
    [ "白虎套装：",
      "最大生命+1920",
      "攻击+216",
      "防御+180",
      "生命恢复+12",
      "力量+48",
      "敏捷+400",
      "物理伤害+108.4",
      "攻击速度+54",
      "攻击频率+17.6%",
      "闪避技巧+160",
      "暴击技巧+48",
      "暴击威力+24" ],
    
    
    [ "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green",
      "light green"]
      
  ],
  
  "996"  =>    # 急速套装 的编号
  [
    
    [ "急速套装"],
    
    
    [ "green"]
      
  ],
#-------------------------------------------------------------------------
  "995"  =>    # Armor 的编号
  [
    
    [ "神力套装" ],
    
    
    [ "light blue" ]
  ],
#------------------------------------------------------------------------
  "5780"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "8"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "5907"  =>    # Armor 的编号
  [
    
    [ "第1行的内容",
      "第2行的内容",
      "第3行的内容",
      "第4行的内容",
      "第5行的内容",
      "第6行的内容",
      "第7行的内容",
      "第8行的内容",
      "第9行的内容",
      "第10行的内容",
      "第11行的内容",
      "第12行的内容",
      "第13行的内容",
    ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1500"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "10"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1611"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "11"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1712"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "12"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1713"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "13"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1714"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "14"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1215"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "15"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "1716"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "16"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "7117"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "17"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "2718"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "18"             ],
    
    
    [ "white",
      "heavy red",
      "light green" ]
  ],
#------------------------------------------------------------------------
  "2719"  =>    # Armor 的编号
  [
    
    [ "第一行的内容",
      "第二行的内容",
      "第三行的内容",
      "19"             ],
    
    
    [ "white",
      "heavy red",
      "light green",
      "brown"        ]
  ],
#-------------------------------------------------------------------------

},

#===========================================================================
#   ●●●●●●●●●●●●这一行用来容错●●●●●●●●●●●●●
#---------------------------------------------------------------------------
{}

#===========================================================================
#   ●●●●●●●●●●●●所有装备结束●●●●●●●●●●●●●
#---------------------------------------------------------------------------  
]
  
#----------------------------------------------------------------------------
#   下面的可以手动定义一个新的英雄。
#   
#   注意：英雄必须是与数据库中的角色对应的，也就是说这里面第0个
#         元素（第一个英雄），其actor_id对应数据库中第一个角色（actor_id = 1）
#         在下面的表中，并没有给出英雄的actor_id就是因为拿元素下标-1做了
#         actor_id
# 
#---------------------------------------------------------------------------

  Init_Heros_Table =  [
#============================================================================    
#  HP      MP   攻击   护甲   力量   敏捷   智力   物理伤害   物理伤害率  
#----------------------------------------------------------------------------
#     魔法伤害  魔法伤害率  攻速   攻速率   闪避   闪避率   暴击   暴击率
#----------------------------------------------------------------------------
#     暴击倍数  命中因子   命中率  hpcover/s  hprate/s  mpcover/s   mprate/s 
#----------------------------------------------------------------------------
#       type    class_id   武器1  武器2  头部  项链  盾  衣服  戒指  鞋子     
#----------------------------------------------------------------------------
#       宝物1    宝物2     宝物3  宝物4  宝物5  宝物6
#===========================================================================
#   ●●●●●●●●●●●●●1号勇士●●●●●●●●●●●●●
#---------------------------------------------------------------------------
 [1800,   1500,  40,    20,    12,     10,     10,      24,        102,
#--------------------------------------------------------------------------
        20,       100,       10,     100,     3,      0,     3,     0,
#--------------------------------------------------------------------------
        110,       8,        0,      10,          0,         1,        0,
#--------------------------------------------------------------------------
        1,         2,        21,     0,    22,    0,   42,  0,    0,   0,
#---------------------------------------------------------------------------
        0,         0,        0,     0,     0,     0
 ],
#===========================================================================    
#   ●●●●●●●●●●●●●2号刺客●●●●●●●●●●●●●
#---------------------------------------------------------------------------
#    
#                   在这里添加刺客信息
# 
#===========================================================================
 [1500,   1500,  40,    23,    10,     12,     10,      20,        100,
#--------------------------------------------------------------------------
        20,       100,       11,     102,     4,      0,     0,     0,
#--------------------------------------------------------------------------
        105,       9,        0,      3,          0,         1,        0,
#--------------------------------------------------------------------------
        2,         2,        4,     0,    0,    0,   42,  51,    0,   0,
#---------------------------------------------------------------------------
        0,         0,        0,     0,    0,    0
 ],
]  

  #--------------------------------------------------------------------------
  # ● 设置各个装备的描述
  #
  # type :装备的类型
  #
  #   0：武器  1：头部  2：项链  3：盾  4：衣服  5：戒指  6：鞋子  7：宝物
  #
  # id   :装备在数据库中的编号,最大999
  #
  #--------------------------------------------------------------------------
  def self.getEquipDes(type, id)
    
    # 如果不是0~7返回空
    return nil if type < 0  or type > 7
    
    # 返回 列表中的[类型号元素][该物品在数据库中的编号]    
    return Equip_Descriptions[type][id.to_s]
    
  end
  
  
end








