module RPG	
	#==============================================================================
	# ■ 示例1  反弹
	#------------------------------------------------------------------------------
	# 	有20%几率将对方造成的伤害的 技能等级 X 5% 以纯粹伤害反弹
	#==============================================================================
	class Fantan_Skill < Skill_Base
		#--------------------------------------------------------------------------
		# ● 初始化
		#--------------------------------------------------------------------------
		def initialize
			super
		end
		#--------------------------------------------------------------------------
		# ● 设置对象	
		#	name		:	技能名字
		#	level		:	技能等级
		# 	battler		:	技能拥有者
		# 	priority	:	优先级 - 越低越优先
		#--------------------------------------------------------------------------
		def setup(name, level, battler, priority = 0)
			super(name, level, battler, priority)
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现can_trigger?
		#--------------------------------------------------------------------------
		def can_trigger?(args)
			if self.battler.hero? == args["target"].hero?
				if $TIME_POST_PRE_DAMAGE == $NOW_TIME
					return true
				end
			end
			return false
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现effect_func触发效果
		#--------------------------------------------------------------------------
		def effect_func(args)
			if (args["target"].hp > 0) and (args["source"].hp > 0)
				if rand(100) < 20
					final_damage = args["final_damage"]
					bounce = @level *0.05 * final_damage
					args["target"].pureDamage(args["source"], bounce)
					animation_func(args)
				end
				#例如，需要给对方增加一个变速效果,持续2秒，结算顺序为1
				state = Single_Speed_Change_State.new
				# 状态施加对象为source, 结算顺序为1， 持续2秒
				state.setup(args["source"], "加速", 1, 2)
				# 速度+100%
				state.speed_rate = 100
				args["source"].add_state(state)
			end
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现effect_func触发效果
		#--------------------------------------------------------------------------
		def animation_func(args)
			super(args)
			animations = []
			animation = {}
			if args["target"].hero?
				animation["seq"] = $Battle_animation_counter_player
				animation["value"] = [1, 124]
				$Battle_animation_counter_player += 1
				animations.push(animation)
			else
				animation["seq"] = $Battle_animation_counter_enemy
				animation["value"] = [1, 124]
				$Battle_animation_counter_enemy += 1
				animations.push(animation)
			end
			args["target"].add_animations(animations)
			
		end
	end
	#==============================================================================
	# ■ 反击 -- 测试通过
	#------------------------------------------------------------------------------
	# 	触发技，角色每次受到攻击有20%几率进行一次反击，不能触发效果
	#==============================================================================
	class FanJi_Skill < Skill_Base
		#--------------------------------------------------------------------------
		# ● 初始化
		#--------------------------------------------------------------------------
		def initialize
			super
		end
		#--------------------------------------------------------------------------
		# ● 设置对象	
		#	name		:	技能名字
		#	level		:	技能等级
		# 	battler		:	技能拥有者
		# 	priority	:	优先级 - 越低越优先
		#--------------------------------------------------------------------------
		def setup(name, level, battler, priority = 0)
			super(name, level, battler, priority)
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现can_trigger?
		#--------------------------------------------------------------------------
		def can_trigger?(args)
			if self.battler.hero? == args["target"].hero?
				if $TIME_POST_DO_DAMAGE == $NOW_TIME
					return true
				end
			end
			return false
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现effect_func触发效果
		#--------------------------------------------------------------------------
		def effect_func(args)
			if (args["target"].hp > 0) and (args["source"].hp > 0)
				if rand(100) < 20
					if args["target"].hero?
						Battle.Battle_strike_back_player
					else
						Battle.Battle_strike_back_enemy
					end
				end
			end
		end
		#--------------------------------------------------------------------------
		# ● 技能描述
		# 		返回一个字符串数组
		# 		e.g., return ["反击：\n",
		# 					  "触发技，\n",
		# 					  "角色每次受到攻击有20%几率进行一次反击，\n",
		#                     "不能触发效果\n",]
		#--------------------------------------------------------------------------
		def description
			return ["反击：",
					"触发技，",
					"角色每次受到攻击有20%几率进行一次反击，",
		            "不能触发效果",]
		end
		#--------------------------------------------------------------------------
		# ● 价格函数
		# 	此函数返回该技能的价格
		#
		#   scalar:   	金钱扩张倍数
		#
		#--------------------------------------------------------------------------
		def price(scalar = 1)
			return Fround(100.0*scalar,1)
		end
	end
	#==============================================================================
	# ■ 冰冻 - 测试通过
	#------------------------------------------------------------------------------
	# 	触发技，角色每次攻击会造成冷冻效果；对方攻速减少50%，持续5秒，不可叠加
	#==============================================================================
	class BinDong_Skill < Skill_Base
		#--------------------------------------------------------------------------
		# ● 初始化
		#--------------------------------------------------------------------------
		def initialize
			super
		end
		#--------------------------------------------------------------------------
		# ● 设置对象	
		#	name		:	技能名字
		#	level		:	技能等级
		# 	battler		:	技能拥有者
		# 	priority	:	优先级 - 越低越优先
		#--------------------------------------------------------------------------
		def setup(name, level, battler, priority = 0)
			super(name, level, battler, priority)
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现can_trigger?
		#--------------------------------------------------------------------------
		def can_trigger?(args)
			if self.battler.hero? != args["target"].hero?
				if $TIME_POST_DO_ATTACK == $NOW_TIME
					return true
				end
			end
			return false
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现effect_func触发效果
		#--------------------------------------------------------------------------
		def effect_func(args)
			if (args["source"].hp > 0)
				state = Single_Speed_Change_State.new
				state.setup(args["target"], "冰冻", 65536, 5)
				state.speed_rate = -50
				if args["target"].state_num(state) > 0
					return
				else
					args["target"].add_state(state)
					animation_func(args)
				end
			end
		end
		#--------------------------------------------------------------------------
		# ● 这是一个触发技能，需要实现effect_func触发效果
		#--------------------------------------------------------------------------
		def animation_func(args)
			super(args)
			animations = []
			animation = {}
			if args["target"].hero?
				animation["seq"] = $Battle_animation_counter_player
				animation["value"] = [1, 125]
				$Battle_animation_counter_player += 1
				animations.push(animation)
			else
				animation["seq"] = $Battle_animation_counter_enemy
				animation["value"] = [1, 125]
				$Battle_animation_counter_enemy += 1
				animations.push(animation)
			end
			args["target"].add_animations(animations)
		end
		#--------------------------------------------------------------------------
		# ● 技能描述
		# 		返回一个字符串数组
		# 		e.g., return ["反击：\n",
		# 					  "触发技，\n",
		# 					  "角色每次受到攻击有20%几率进行一次反击，\n",
		#                     "不能触发效果\n",]
		#--------------------------------------------------------------------------
		def description
			return ["冰冻：",
					"触发技，",
					"角色每次受到攻击有20%几率进行一次反击，",
		            "不能触发效果",]
		end
		#--------------------------------------------------------------------------
		# ● 价格函数
		# 	此函数返回该技能的价格
		#
		#   scalar:   	金钱扩张倍数
		#
		#--------------------------------------------------------------------------
		def price(scalar = 1)
			return Fround(1000.0*scalar,1)
		end
	end
	#==============================================================================
	# ■ 坚守  -- 通过测试
	#------------------------------------------------------------------------------
	# 	锁定技，提升防御力，防御提升百分比为角色失去生命百分比的25%
	#==============================================================================
	class JianShou_Skill < Skill_Base
		#--------------------------------------------------------------------------
		# ● 初始化
		#--------------------------------------------------------------------------
		def initialize
			super
		end
		#--------------------------------------------------------------------------
		# ● 设置对象	
		#	name		:	技能名字
		#	level		:	技能等级
		# 	battler		:	技能拥有者
		# 	priority	:	优先级 - 越低越优先
		#--------------------------------------------------------------------------
		def setup(name, level, battler, priority = 0)
			super(name, level, battler, priority)
		end
		#--------------------------------------------------------------------------
		# ● 锁定技函数
		# 		在技能被添加的时候或者战斗开始的时候被调用，一般是添加状态
		#--------------------------------------------------------------------------
		def compulsory_func
			state = JianShou_State.new
			state.setup(@battler, "坚守", 32768, 72000)
			state.ratio = 50
			@battler.add_state(state)
		end
		#--------------------------------------------------------------------------
		# ● 技能描述
		# 		返回一个字符串数组
		# 		e.g., return ["反击：\n",
		# 					  "触发技，\n",
		# 					  "角色每次受到攻击有20%几率进行一次反击，\n",
		#                     "不能触发效果\n",]
		#--------------------------------------------------------------------------
		def description
			return ["坚守：",
					"触发技，",
					"角色每次受到攻击有20%几率进行一次反击，",
		            "不能触发效果",]
		end
		#--------------------------------------------------------------------------
		# ● 价格函数
		# 	此函数返回该技能的价格
		#
		#   scalar:   	金钱扩张倍数
		#
		#--------------------------------------------------------------------------
		def price(scalar = 1)
			return Fround(900.0*scalar,1)
		end
	end
end